# Pandas: It is a python library which is use to work on large data set to handling,cleaning,analysing and manipulating the data:

In [2]:
import pandas as pd

In [3]:
#print(dir(pd))

# Series: 1-D array (list of elements)

In [4]:
#pd.Series? #Series is same as 1-D array just series of elements:

In [17]:
x=[1,2,3,4,5]
a=pd.Series(x,name="python") # will provide unique indexing for each row: will name the data set as "python":
print(a)

0    1
1    2
2    3
3    4
4    5
Name: python, dtype: int64

In [5]:
s3=pd.Series(13) # this can also returns a single element with it's index:
s3

0    13
dtype: int64

In [28]:
s1=pd.Series(12,index=[1,2,3])
s2=pd.Series(12,index=[1,2,3,4,5,6])
print(s1)
print(s2)
print(s1+s2) # will only return the addition of elements, having elements on same index for rest will return NaN(Not a Number):

1    12
2    12
3    12
dtype: int64
1    12
2    12
3    12
4    12
5    12
6    12
dtype: int64
1    24.0
2    24.0
3    24.0
4     NaN
5     NaN
6     NaN
dtype: float64

In [30]:
x=[1,2,3,4,5]
b=[6,7,8]
a=pd.Series(x+b,name="python") # here the elements of x and b will concate in a single list:
print(a)  #dtype will be int as all list consist of numbers:

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
Name: python, dtype: int64

In [34]:
dict = {"name":["Tarun","Chirag","Vihar"], "Roll_no":[1,2,3],"City":["Ahmedabad","Pali","Mehsana"]}
ab=pd.Series(dict)
print(ab) # dtype will be object as the elements in the dictonary are mix datatypes:
print(type(ab))
ab[1:3] # slicing with series:

name           [Tarun, Chirag, Vihar]
Roll_no                     [1, 2, 3]
City       [Ahmedabad, Pali, Mehsana]
dtype: object
<class 'pandas.core.series.Series'>

Roll_no                     [1, 2, 3]
City       [Ahmedabad, Pali, Mehsana]
dtype: object

# DataFrame : 2-D arrays:

In [74]:
dict = {"name":["Tarun","Chirag","Vihar"], "Roll_no":[1,2,3],"City":["Ahmedabad","Pali","Mehsana"]}
s1=pd.DataFrame(dict)

In [75]:
s1

     name  Roll_no       City
0   Tarun        1  Ahmedabad
1  Chirag        2       Pali
2   Vihar        3    Mehsana

In [76]:
s1.iloc[1] # for using indexing in DataFrame: iloc=integerlocation("When indexing is in integers):otherwise use: loc=location

name       Chirag
Roll_no         2
City         Pali
Name: 1, dtype: object

In [77]:
s1.iloc[1:3]

     name  Roll_no     City
1  Chirag        2     Pali
2   Vihar        3  Mehsana

In [78]:
s1.index=["a","b","c"] # what if the indexes are not number but alphaets:

In [79]:
s1

     name  Roll_no       City
a   Tarun        1  Ahmedabad
b  Chirag        2       Pali
c   Vihar        3    Mehsana

In [80]:
s1.loc["a"] #loc["str_element"]=location for getting an element through indexing:

name           Tarun
Roll_no            1
City       Ahmedabad
Name: a, dtype: object

In [81]:
s1.loc["b"]

name       Chirag
Roll_no         2
City         Pali
Name: b, dtype: object

In [82]:
s1.loc["b":"c"] # or s1["b","c"] will return the same result:

     name  Roll_no     City
b  Chirag        2     Pali
c   Vihar        3  Mehsana

In [83]:
s1.loc["c"]

name         Vihar
Roll_no          3
City       Mehsana
Name: c, dtype: object

In [84]:
s1.index

Index(['a', 'b', 'c'], dtype='object')

In [85]:
s1.columns

Index(['name', 'Roll_no', 'City'], dtype='object')

In [90]:
s1.columns=["st_name","st_roll","st_city"] # to change the columns name:

In [93]:
s1

  st_name  st_roll    st_city
a   Tarun        1  Ahmedabad
b  Chirag        2       Pali
c   Vihar        3    Mehsana

In [100]:
product=["Power Bank","Mobiles","Earbuds","Chargers"] 
unit=[25,65,22,85]
d=pd.DataFrame({"P":product,"U":unit}) # here list got as the values in the dictionary
d

            P   U
0  Power Bank  25
1     Mobiles  65
2     Earbuds  22
3    Chargers  85

In [101]:
d.columns=["Product","No_Units"]

In [102]:
d

      Product  No_Units
0  Power Bank        25
1     Mobiles        65
2     Earbuds        22
3    Chargers        85

In [115]:
print(s1["st_name"]) # when you want return the data from columns

a     Tarun
b    Chirag
c     Vihar
Name: st_name, dtype: object

In [121]:
s1[["st_name","st_city"]] # use [["colum1","column2"]] to get the selected columns at a time:

  st_name    st_city
a   Tarun  Ahmedabad
b  Chirag       Pali
c   Vihar    Mehsana

In [150]:
l=[1,2,3,4,5]
ind=[7,8,9,6,10]
co=["Col_name"]
l1=pd.DataFrame(l,ind,co) # (row,index(should be equal to no of rows),columns(should be equals to no of col.))
l1
print

    Col_name
7          1
8          2
9          3
6          4
10         5

In [142]:
l=[1,2,3,4,5]
l2=[7,8,9,6,10]
d={"L":l,"L2":l2}
l1=pd.DataFrame(d)
l1

   L  L2
0  1   7
1  2   8
2  3   9
3  4   6
4  5  10

In [222]:
l1=[[1,2,3,4,5],[11,12,13,14,15]]
col=["a","b","c","d","e"]
index=["a","b"]
d1=pd.DataFrame(l1,index,col)
print(d1)
print(d1["d"]["b"]) # to print the specific element from the array use [col_name or no.][row_name or no.]

    a   b   c   d   e
a   1   2   3   4   5
b  11  12  13  14  15
14

# By using muliple series we can use data frames as well:

In [231]:
s1={"l1":pd.Series([1,2,3,4]),"l2": pd.Series([8,5,4,8,6])} # the column which contain NaN value will conver to float:
df=pd.DataFrame(s1)
df

    l1  l2
0  1.0   8
1  2.0   5
2  3.0   4
3  4.0   8
4  NaN   6

In [232]:
print(df["l2"][3])

8

In [214]:
b=[[1,2,3,4],[5,4,6,8]] # this will distribute the elements into column:
c=pd.DataFrame(b)

In [215]:
c

   0  1  2  3
0  1  2  3  4
1  5  4  6  8

In [238]:
print(c[3][1])
c[[1,2]] # only print the values of 1,2 columns

8

   1  2
0  2  3
1  4  6

In [237]:
df[:4]

    l1  l2
0  1.0   8
1  2.0   5
2  3.0   4
3  4.0   8